blackdemon-1949/USB_UCPD_NEW/USB_UCPD/USB_UCPD.ioc
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false-Boot,2-MX_GPIO_Init-GPIO-false-HAL-true-Boot,3-MX_GPDMA1_Init-GPDMA1-false-HAL-true-Boot,4-MX_XSPI1_Init-XSPI1-false-HAL-true-Boot,5-MX_EXTMEM_MANAGER_Init-EXTMEM_MANAGER-false-HAL-false-Boot,1-SystemClock_Config-RCC-false-HAL-false-Appli,2-MX_GPIO_Init-GPIO-false-HAL-true-Appli,3-MX_GPDMA1_Init-GPDMA1-false-HAL-true-Appli,4-MX_USB_DEVICE_Init-USB_DEVICE-true-HAL-false-Appli,5-MX_UCPD1_Init-UCPD1-false-LL-true-Appli,6-MX_USBPD_Init-USBPD-false-HAL-false-Appli,7-MX_I2C2_Init-I2C2-false-HAL-true-Appli,8-MX_DTS_Init-DTS-false-HAL-true-Appli,9-MX_USART2_UART_Init-USART2-false-HAL-true-Appli,10-MX_USART1_UART_Init-USART1-false-HAL-true-Appli,11-MX_CRC_Init-CRC-false-HAL-true-Appli,12-MX_HASH_Init-HASH-false-HAL-true-Appli,13-MX_RNG_Init-RNG-false-HAL-true-Appli,14-MX_TRACER_EMB_Init-TRACER_EMB-false-HAL-true-Appli,0-MX_CORTEX_M7_BOOT_Init-CORTEX_M7_BOOT-false-HAL-true-Boot,0-MX_CORTEX_M7_APPLI_Init-CORTEX_M7_APPLI-false-HAL-true-Appli,0-MX_PWR_Init-PWR-false-HAL-true-Appli,1-SystemClock_Config-RCC-false-HAL-false-ExtMemLoader,2-MX_GPDMA1_Init-GPDMA1-false-HAL-true-ExtMemLoader,3-MX_EXTMEM_MANAGER_Init-EXTMEM_MANAGER-false-HAL-false-ExtMemLoader
RCC.ADCFreq_Value=200000000
RCC.ADFFreq_Value=300000000
RCC.AHB1234Freq_Value=300000000
RCC.AHB5ClockFreq_Value=300000000
RCC.APB1Freq_Value=150000000
RCC.APB2Freq_Value=150000000
RCC.APB4Freq_Value=150000000
RCC.APB5Freq_Value=150000000
RCC.AXIClockFreq_Value=300000000
RCC.BMPRE=RCC_HCLK_DIV2
RCC.CECFreq_Value=32768
RCC.CKPERFreq_Value=64000000
RCC.CPREFreq_Value=600000000
RCC.CortexFreq_Value=600000000
RCC.CpuClockFreq_Value=600000000
RCC.DIVM1=2
RCC.DIVM2=3
RCC.DIVM3=2
RCC.DIVN1=50
RCC.DIVN2=50
RCC.DIVN3=34
RCC.DIVP1=1
RCC.DIVP1Freq_Value=600000000
RCC.DIVP2Freq_Value=200000000
RCC.DIVP3Freq_Value=204000000
RCC.DIVQ1Freq_Value=300000000
RCC.DIVQ2Freq_Value=200000000
RCC.DIVQ3=17
RCC.DIVQ3Freq_Value=24000000
RCC.DIVR1Freq_Value=300000000
RCC.DIVR2Freq_Value=200000000
RCC.DIVR3Freq_Value=204000000
RCC.DIVS1Freq_Value=300000000
RCC.DIVS2=4
RCC.DIVS2Freq_Value=100000000
RCC.DIVS3Freq_Value=204000000
RCC.DIVT1Freq_Value=300000000
RCC.DIVT2Freq_Value=200000000
RCC.DIVT3Freq_Value=204000000
RCC.DTSFreq_Value=32768
RCC.ETH1Freq_Value=12288000
RCC.ETHPHYFreq_Value=24000000
RCC.FDCANFreq_Value=24000000
RCC.FMCFreq_Value=300000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=300000000
RCC.HSE_VALUE=24000000
RCC.I2C23Freq_Value=150000000
RCC.I2CI3C1Freq_Value=150000000
RCC.IPParameters=ADCFreq_Value,ADFFreq_Value,AHB1234Freq_Value,AHB5ClockFreq_Value,APB1Freq_Value,APB2Freq_Value,APB4Freq_Value,APB5Freq_Value,AXIClockFreq_Value,BMPRE,CECFreq_Value,CKPERFreq_Value,CPREFreq_Value,CortexFreq_Value,CpuClockFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,DIVS1Freq_Value,DIVS2,DIVS2Freq_Value,DIVS3Freq_Value,DIVT1Freq_Value,DIVT2Freq_Value,DIVT3Freq_Value,DTSFreq_Value,ETH1Freq_Value,ETHPHYFreq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,I2C23Freq_Value,I2CI3C1Freq_Value,LPTIM1Freq_Value,LPTIM23Freq_Value,LPTIM45Freq_Value,LPUART1Freq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,OSPI1Freq_Value,PLL2FRACN,PLL3FRACN,PLLFRACN,PLLSource,PPRE1,PPRE2,PPRE4,PPRE5,PSSIFreq_Value,RTCClockSelection,RTCFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI1Freq_Value,SPI23Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TPIUFreq_Value,Tim1OutputFreq_Value,Tim2OutputFreq_Value,UCPDFreq_Value,USART1Freq_Value,USART234578Freq_Value,USBOFSFreq_Value,USBPHYFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,Xspi1ClockSelection
RCC.LPTIM1Freq_Value=150000000
RCC.LPTIM23Freq_Value=150000000
RCC.LPTIM45Freq_Value=150000000
RCC.LPUART1Freq_Value=150000000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=600000000
RCC.OSPI1Freq_Value=100000000
RCC.PLL2FRACN=0
RCC.PLL3FRACN=0
RCC.PLLFRACN=0
RCC.PLLSource=RCC_PLLSOURCE_HSE
RCC.PPRE1=RCC_APB1_DIV2
RCC.PPRE2=RCC_APB2_DIV2
RCC.PPRE4=RCC_APB4_DIV2
RCC.PPRE5=RCC_APB5_DIV2
RCC.PSSIFreq_Value=204000000
RCC.RTCClockSelection=RCC_RTCCLKSOURCE_LSE
RCC.RTCFreq_Value=32768
RCC.SAI1Freq_Value=300000000
RCC.SAI2Freq_Value=300000000
RCC.SDMMCFreq_Value=100000000
RCC.SPDIFRXFreq_Value=300000000
RCC.SPI1Freq_Value=300000000
RCC.SPI23Freq_Value=300000000
RCC.SPI45Freq_Value=150000000
RCC.SPI6Freq_Value=150000000
RCC.SYSCLKFreq_VALUE=600000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.TPIUFreq_Value=200000000
RCC.Tim1OutputFreq_Value=300000000
RCC.Tim2OutputFreq_Value=300000000
RCC.UCPDFreq_Value=16000000
RCC.USART1Freq_Value=150000000
RCC.USART234578Freq_Value=150000000
RCC.USBOFSFreq_Value=48000000
RCC.USBPHYFreq_Value=24000000
RCC.VCO1OutputFreq_Value=600000000
RCC.VCO2OutputFreq_Value=400000000
RCC.VCO3OutputFreq_Value=408000000
RCC.VCOInput1Freq_Value=12000000
RCC.VCOInput2Freq_Value=8000000
RCC.VCOInput3Freq_Value=12000000
RCC.Xspi1ClockSelection=RCC_XSPI1CLKSOURCE_PLL2S
USART1.IPParameters=VirtualMode-Asynchronous
USART1.VirtualMode-Asynchronous=VM_ASYNC
USART2.IPParameters=VirtualMode-Asynchronous
USART2.VirtualMode-Asynchronous=VM_ASYNC
USBPD.CAD_AccesorySupport_P0=USBPD_TRUE
USBPD.IPParameters=Is_GetPPSStatus_Supported_P0,Is_SrcCapaExt_Supported_P0,USBPD_PORT0_PDO_SNK_FIXED_SET_OP_CURRENT_0,Is_GetManufacturerInfo_Supported_P0,USBPD_PORT0_PDO_SNK_NB,PE_UnchunkSupport_P0,PE_DR_Swap_To_DFP_P0,PE_DR_Swap_To_UFP_P0,PE_SupportedSOPapos_P0,PE_SupportedSOPquot_P0,USBPD_DEVICE_APP_MEM_POOL_SIZE,PE_VDMSupport_P0,PE_RespondsToDiscovSOP_P0,PE_AttemptsDiscovSOP_P0,PE_CapscounterSupport_P0,USBPD_PDO_FIXED_HIGHERCAPAB_P0,USBPD_PDO_FIXED_USBCOMM_P0,USBPD_PDO_FIXED_EXT_POWER_P0,USBPD_PDO_FIXED_USBSUSPEND_P0,Is_Alert_Supported_P0,Is_GetStatus_Supported_P0,Is_GetCountryCodes_Supported_P0,Is_GetCountryInfo_Supported_P0,Is_SecurityRequest_Supported_P0,Is_FirmUpdateRequest_Supported_P0,Is_GetBattery_Supported_P0,CAD_AccesorySupport_P0,PE_VconnSwap_P0,PE_DataSwap_P0
USBPD.Is_Alert_Supported_P0=USBPD_TRUE
USBPD.Is_FirmUpdateRequest_Supported_P0=USBPD_TRUE
USBPD.Is_GetBattery_Supported_P0=USBPD_TRUE
USBPD.Is_GetCountryCodes_Supported_P0=USBPD_TRUE
USBPD.Is_GetCountryInfo_Supported_P0=USBPD_TRUE
USBPD.Is_GetManufacturerInfo_Supported_P0=USBPD_TRUE
USBPD.Is_GetPPSStatus_Supported_P0=USBPD_TRUE
USBPD.Is_GetStatus_Supported_P0=USBPD_TRUE
USBPD.Is_SecurityRequest_Supported_P0=USBPD_TRUE
USBPD.Is_SrcCapaExt_Supported_P0=USBPD_TRUE
USBPD.PE_AttemptsDiscovSOP_P0=USBPD_TRUE
USBPD.PE_CapscounterSupport_P0=USBPD_TRUE
USBPD.PE_DR_Swap_To_DFP_P0=USBPD_TRUE
USBPD.PE_DR_Swap_To_UFP_P0=USBPD_TRUE
USBPD.PE_DataSwap_P0=USBPD_TRUE
USBPD.PE_RespondsToDiscovSOP_P0=USBPD_TRUE
USBPD.PE_SupportedSOPapos_P0=USBPD_SUPPORTED_SOP_SOP1
USBPD.PE_SupportedSOPquot_P0=USBPD_SUPPORTED_SOP_SOP2
USBPD.PE_UnchunkSupport_P0=USBPD_TRUE
USBPD.PE_VDMSupport_P0=USBPD_TRUE
USBPD.PE_VconnSwap_P0=USBPD_TRUE
USBPD.USBPD_DEVICE_APP_MEM_POOL_SIZE=8192
USBPD.USBPD_PDO_FIXED_EXT_POWER_P0=VUSBPD_PDO_FIXED_EXT_POWER_SUPPORTED
USBPD.USBPD_PDO_FIXED_HIGHERCAPAB_P0=USBPD_PDO_SNK_FIXED_HIGHERCAPAB_SUPPORTED
USBPD.USBPD_PDO_FIXED_USBCOMM_P0=USBPD_PDO_FIXED_USBCOMM_SUPPORTED
USBPD.USBPD_PDO_FIXED_USBSUSPEND_P0=USBPD_PDO_SRC_FIXED_USBSUSPEND_SUPPORTED
USBPD.USBPD_PORT0_PDO_SNK_FIXED_SET_OP_CURRENT_0=3000
USBPD.USBPD_PORT0_PDO_SNK_NB=1
USB_DEVICE.APP_RX_DATA_SIZE-CDC_HS=2048
USB_DEVICE.APP_TX_DATA_SIZE-CDC_HS=2048
USB_DEVICE.CLASS_NAME_HS=CDC
USB_DEVICE.IPParameters=VirtualModeHS,CLASS_NAME_HS,VirtualMode-CDC_HS,USBD_MAX_NUM_INTERFACES-CDC_HS,USBD_SELF_POWERED-CDC_HS,APP_RX_DATA_SIZE-CDC_HS,APP_TX_DATA_SIZE-CDC_HS
USB_DEVICE.USBD_MAX_NUM_INTERFACES-CDC_HS=2
USB_DEVICE.USBD_SELF_POWERED-CDC_HS=1
USB_DEVICE.VirtualMode-CDC_HS=Cdc
USB_DEVICE.VirtualModeHS=Cdc_HS
USB_OTG_HS.IPParameters=VirtualMode,dma_enable,RefClockSelection
USB_OTG_HS.RefClockSelection=SYSCFG_OTG_HS_PHY_CLK_SELECT_4
USB_OTG_HS.VirtualMode=Device_HS
USB_OTG_HS.dma_enable=DISABLE
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_DTS_VS-DTS.Mode=DTS
VP_DTS_VS-DTS.Signal=DTS_VS-DTS
VP_EXTMEM_MANAGER_SIG_Activate_EXTMEM.Mode=Activate_EXTMEM
VP_EXTMEM_MANAGER_SIG_Activate_EXTMEM.Signal=EXTMEM_MANAGER_SIG_Activate_EXTMEM
VP_GPDMA1_VS_GPDMACH0.Mode=SIMPLEREQUEST_GPDMACH0
VP_GPDMA1_VS_GPDMACH0.Signal=GPDMA1_VS_GPDMACH0
VP_GPDMA1_VS_GPDMACH1.Mode=SIMPLEREQUEST_GPDMACH1
VP_GPDMA1_VS_GPDMACH1.Signal=GPDMA1_VS_GPDMACH1
VP_GPDMA1_VS_GPDMACH2.Mode=SIMPLEREQUEST_GPDMACH2
VP_GPDMA1_VS_GPDMACH2.Signal=GPDMA1_VS_GPDMACH2
VP_GPDMA1_VS_GPDMACH3.Mode=SIMPLEREQUEST_GPDMACH3
VP_GPDMA1_VS_GPDMACH3.Signal=GPDMA1_VS_GPDMACH3
VP_HASH_VS_HASH.Mode=HASH_Activate
VP_HASH_VS_HASH.Signal=HASH_VS_HASH
VP_MEMORYMAP_VS_MEMORYMAP.Mode=CurAppReg
VP_MEMORYMAP_VS_MEMORYMAP.Signal=MEMORYMAP_VS_MEMORYMAP
VP_PWR_VS_USBReg.Mode=USBReg
VP_PWR_VS_USBReg.Signal=PWR_VS_USBReg
VP_RNG_VS_RNG.Mode=RNG_Activate
VP_RNG_VS_RNG.Signal=RNG_VS_RNG
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TRACER_EMB_VS_traceremb_usart1.Mode=TRACER_EMB_USART1
VP_TRACER_EMB_VS_traceremb_usart1.Signal=TRACER_EMB_VS_traceremb_usart1
VP_USBPD_VS_PD3FULL.Mode=PD3_Full_Stack
VP_USBPD_VS_PD3FULL.Signal=USBPD_VS_PD3FULL
VP_USBPD_VS_USBPD1.Mode=USBPD_P0
VP_USBPD_VS_USBPD1.Signal=USBPD_VS_USBPD1
VP_USBPD_VS_usbpd_tim2.Mode=TIM2
VP_USBPD_VS_usbpd_tim2.Signal=USBPD_VS_usbpd_tim2
VP_USBPD_VS_usbpd_traceremb.Mode=TRACER_EMB
VP_USBPD_VS_usbpd_traceremb.Signal=USBPD_VS_usbpd_traceremb
VP_USB_DEVICE_VS_USB_DEVICE_CDC_HS.Mode=CDC_HS
VP_USB_DEVICE_VS_USB_DEVICE_CDC_HS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_HS
VP_XSPI1_VS_quad.Mode=quad_mode
VP_XSPI1_VS_quad.Signal=XSPI1_VS_quad
XSPI1.ChipSelectHighTimeCycle=2
XSPI1.ClockMode=HAL_XSPI_CLOCK_MODE_0
XSPI1.IPParameters=MemoryType,MemorySize,ChipSelectHighTimeCycle,ClockMode
XSPI1.MemorySize=HAL_XSPI_SIZE_64MB
XSPI1.MemoryType=HAL_XSPI_MEMTYPE_MACRONIX
board=custom
